Version2/TestTool-Fosters/TestTool.Setup/Requests/DoorControl/GetDoorInfoListByTokenList/WithSeveralTokens.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tdc="http://www.onvif.org/ver10/doorcontrol/wsdl">
   <soap:Header/>
   <soap:Body>
      <tdc:GetDoorInfoListByTokenList>
         <!--Optional-->
         <tdc:TokenList>
            <!--Zero or more repetitions-->
            <tdc:Token>tokenDoor1</tdc:Token>
<tdc:Token>tokenDoor2</tdc:Token>
         </tdc:TokenList>
      </tdc:GetDoorInfoListByTokenList>
   </soap:Body>
</soap:Envelope>